k6/results/ranking-benchmark-2026-04-08T11-39-10.txt
============================================================
Ranking System Benchmark — 2026-04-08T11:39:10.467Z
============================================================

[ Scenarios ]

  ranking_read_light:
    executor:  constant-vus (50 VUs, 30s)
    endpoint:  GET /api/v1/rankings?page=1&size=20
    purpose:   랭킹 페이지 조회 기본 부하

  product_detail_rank:
    executor:  constant-vus (100 VUs, 30s)
    endpoint:  GET /api/v1/products/{id}
    purpose:   상품 상세 + rank enrichment + outbox→streamer 쓰기 구동

  ranking_read_heavy:
    executor:  ramping-vus (0→200→0, 25s, starts at 35s)
    purpose:   랭킹 페이지 동시 조회 폭증

  ranking_deep_page:
    executor:  constant-vus (30 VUs, 15s, starts at 65s)
    endpoint:  GET /api/v1/rankings?page={1..5}&size=50
    purpose:   deep pagination 오버헤드

[ Thresholds ]
    http_req_failed: rate < 0.05
    ranking_page:    p(95)<500ms, p(99)<1000ms
    product_detail:  p(95)<800ms, p(99)<1500ms

[ Target ]  http://localhost:8080
[ Products ] id=1..100

============================================================
     ✓ detail: 200
     ✓ ranking_light: 200
     ✓ ranking_heavy: 200
     ✓ ranking_deep: 200

     checks.........................: 100.00% ✓ 71141      ✗ 0    
     data_received..................: 148 MB  1.9 MB/s
     data_sent......................: 6.8 MB  85 kB/s
     http_req_blocked...............: avg=24.81µs  min=0s      med=2µs      max=78.1ms   p(90)=4µs      p(95)=5µs     
     http_req_connecting............: avg=21.56µs  min=0s      med=0s       max=76.54ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=5.96ms   min=1.06ms  med=4.8ms    max=53.82ms  p(90)=10.42ms  p(95)=13.06ms 
       { expected_response:true }...: avg=5.96ms   min=1.06ms  med=4.8ms    max=53.82ms  p(90)=10.42ms  p(95)=13.06ms 
     ✓ { name:product_detail }......: avg=8.18ms   min=1.59ms  med=7.23ms   max=53.82ms  p(90)=13.22ms  p(95)=16.11ms 
     ✓ { name:ranking_page }........: avg=4.55ms   min=1.06ms  med=3.89ms   max=48.06ms  p(90)=6.92ms   p(95)=8.9ms   
   ✓ http_req_failed................: 0.00%   ✓ 0          ✗ 71141
     http_req_receiving.............: avg=75.68µs  min=4µs     med=50µs     max=6.23ms   p(90)=155µs    p(95)=211µs   
     http_req_sending...............: avg=6.91µs   min=1µs     med=4µs      max=1.45ms   p(90)=12µs     p(95)=19µs    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=5.88ms   min=979µs   med=4.71ms   max=53.79ms  p(90)=10.35ms  p(95)=12.96ms 
     http_reqs......................: 71141   888.075587/s
     iteration_duration.............: avg=126.29ms min=101.3ms med=105.45ms max=582.67ms p(90)=115.77ms p(95)=208.75ms
     iterations.....................: 71141   888.075587/s
     product_detail_latency_ms......: avg=8.186852 min=1.594   med=7.239    max=53.822   p(90)=13.22    p(95)=16.1193 
     product_detail_ok..............: 27635   344.976439/s
     product_detail_with_rank.......: 27635   344.976439/s
     ranking_read_latency_ms........: avg=4.550657 min=1.064   med=3.895    max=48.061   p(90)=6.9225   p(95)=8.9045  
     ranking_read_ok................: 43506   543.099148/s
     read_success_rate..............: 100.00% ✓ 68951      ✗ 0    
     vus............................: 30      min=0        max=200
     vus_max........................: 350     min=350      max=350