k6/results/ranking-benchmark-heavy-2026-04-09T13-41-42.txt
============================================================
Ranking System Benchmark (HEAVY) — 2026-04-09T13:41:42.882Z
============================================================

[ Scenarios ]

  ranking_read_light:
    executor:  constant-vus (100 VUs, 45s)
    endpoint:  GET /api/v1/rankings?page=1&size=20
    purpose:   랭킹 페이지 조회 기본 부하 (2× base)

  product_detail_rank:
    executor:  constant-vus (200 VUs, 45s)
    endpoint:  GET /api/v1/products/{id}
    purpose:   상품 상세 + rank enrichment (2× base, 1000 products)

  ranking_read_heavy:
    executor:  ramping-vus (0→400→0, 30s, starts at 50s)
    purpose:   랭킹 페이지 동시 조회 폭증 (2× base)

  ranking_deep_page:
    executor:  constant-vus (60 VUs, 20s, starts at 85s)
    endpoint:  GET /api/v1/rankings?page={1..10}&size=50
    purpose:   deep pagination 오버헤드 (2× depth)

[ Thresholds ]
    http_req_failed: rate < 0.05
    ranking_page:    p(95)<500ms, p(99)<1000ms
    product_detail:  p(95)<800ms, p(99)<1500ms

[ Target ]  http://localhost:8080
[ Products ] id=1..1028
[ ZSET entries ] 1000

============================================================
     ✗ detail: 200
      ↳  97% — ✓ 79739 / ✗ 2292
     ✓ ranking_light: 200
     ✓ ranking_heavy: 200
     ✓ ranking_deep: 200

     checks.........................: 98.80% ✓ 189892      ✗ 2292  
     data_received..................: 451 MB 4.3 MB/s
     data_sent......................: 18 MB  174 kB/s
     http_req_blocked...............: avg=37.14µs  min=0s       med=1µs      max=66.4ms   p(90)=3µs      p(95)=4µs     
     http_req_connecting............: avg=32.78µs  min=0s       med=0s       max=63.83ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=6.98ms   min=1.23ms   med=5.54ms   max=86.92ms  p(90)=11.74ms  p(95)=14.05ms 
       { expected_response:true }...: avg=6.9ms    min=1.23ms   med=5.47ms   max=86.92ms  p(90)=11.59ms  p(95)=13.87ms 
     ✓ { name:product_detail }......: avg=9.54ms   min=1.66ms   med=9.2ms    max=73.14ms  p(90)=13.08ms  p(95)=15.11ms 
     ✓ { name:ranking_page }........: avg=5.08ms   min=1.23ms   med=3.98ms   max=86.92ms  p(90)=7.42ms   p(95)=11.82ms 
   ✓ http_req_failed................: 1.19%  ✓ 2292        ✗ 189892
     http_req_receiving.............: avg=68.84µs  min=4µs      med=47µs     max=12.74ms  p(90)=144µs    p(95)=184µs   
     http_req_sending...............: avg=6.17µs   min=1µs      med=4µs      max=3.28ms   p(90)=10µs     p(95)=18µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=6.9ms    min=1.18ms   med=5.46ms   max=86.89ms  p(90)=11.68ms  p(95)=13.96ms 
     http_reqs......................: 192184 1826.752265/s
     iteration_duration.............: avg=128.8ms  min=101.31ms med=106.45ms max=576.89ms p(90)=116.01ms p(95)=221.73ms
     iterations.....................: 192184 1826.752265/s
     product_detail_latency_ms......: avg=9.433648 min=1.663    med=9.149    max=70.441   p(90)=12.895   p(95)=14.8931 
     product_detail_ok..............: 79739  757.937179/s
     product_detail_with_rank.......: 79739  757.937179/s
     ranking_read_latency_ms........: avg=5.080558 min=1.238    med=3.981    max=86.925   p(90)=7.4248   p(95)=11.8294 
     ranking_read_ok................: 110153 1047.029109/s
     read_success_rate..............: 98.77% ✓ 184249      ✗ 2292  
     vus............................: 60     min=0         max=400 
     vus_max........................: 700    min=700       max=700